<a href="https://colab.research.google.com/github/VasaviLagishetty/Pandas/blob/master/DataFrame_Basics1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [2]:
url = "https://raw.githubusercontent.com/VasaviLagishetty/Pandas/master/Datasets/jamesbond.csv"
jamesbond = pd.read_csv(url)
jamesbond.head(15)

                               Film  Year  ... Budget Bond Actor Salary
0                            Dr. No  1962  ...    7.0               0.6
1             From Russia with Love  1963  ...   12.6               1.6
2                        Goldfinger  1964  ...   18.6               3.2
3                       Thunderball  1965  ...   41.9               4.7
4                     Casino Royale  1967  ...   85.0               NaN
5               You Only Live Twice  1967  ...   59.9               4.4
6   On Her Majesty's Secret Service  1969  ...   37.3               0.6
7              Diamonds Are Forever  1971  ...   34.7               5.8
8                  Live and Let Die  1973  ...   30.8               NaN
9       The Man with the Golden Gun  1974  ...   27.7               NaN
10             The Spy Who Loved Me  1977  ...   45.1               NaN
11                        Moonraker  1979  ...   91.5               NaN
12               For Your Eyes Only  1981  ...   60.2               NaN
13            Never Say Never Again  1983  ...   86.0               NaN
14                        Octopussy  1983  ...   53.9               7.8

[15 rows x 7 columns]

In [3]:
jamesbond = jamesbond.set_index("Film")      # setting Film column as index
jamesbond.head(5)

                       Year         Actor  ... Budget  Bond Actor Salary
Film                                       ...
Dr. No                 1962  Sean Connery  ...    7.0                0.6
From Russia with Love  1963  Sean Connery  ...   12.6                1.6
Goldfinger             1964  Sean Connery  ...   18.6                3.2
Thunderball            1965  Sean Connery  ...   41.9                4.7
Casino Royale          1967   David Niven  ...   85.0                NaN

[5 rows x 6 columns]

In [4]:
jamesbond = jamesbond.reset_index(drop=False)        # dropping film column as index
jamesbond.head(5)

                    Film  Year  ... Budget Bond Actor Salary
0                 Dr. No  1962  ...    7.0               0.6
1  From Russia with Love  1963  ...   12.6               1.6
2             Goldfinger  1964  ...   18.6               3.2
3            Thunderball  1965  ...   41.9               4.7
4          Casino Royale  1967  ...   85.0               NaN

[5 rows x 7 columns]

In [5]:
jamesbond = jamesbond.set_index("Director")         # setting Director as index
jamesbond.head(5)

                                Film  Year  ... Budget  Bond Actor Salary
Director                                    ...
Terence Young                 Dr. No  1962  ...    7.0                0.6
Terence Young  From Russia with Love  1963  ...   12.6                1.6
Guy Hamilton              Goldfinger  1964  ...   18.6                3.2
Terence Young            Thunderball  1965  ...   41.9                4.7
Ken Hughes             Casino Royale  1967  ...   85.0                NaN

[5 rows x 6 columns]

In [6]:
jamesbond = jamesbond.set_index("Year")            # setting Year as index
jamesbond.head(6)

                       Film         Actor  ...  Budget  Bond Actor Salary
Year                                       ...
1962                 Dr. No  Sean Connery  ...     7.0                0.6
1963  From Russia with Love  Sean Connery  ...    12.6                1.6
1964             Goldfinger  Sean Connery  ...    18.6                3.2
1965            Thunderball  Sean Connery  ...    41.9                4.7
1967          Casino Royale   David Niven  ...    85.0                NaN
1967    You Only Live Twice  Sean Connery  ...    59.9                4.4

[6 rows x 5 columns]

In [7]:
jamesbond.loc[2006]        # iloc['column_value'] used for retrieving complete row based on index column

Film                 Casino Royale
Actor                 Daniel Craig
Box Office                   581.5
Budget                       145.3
Bond Actor Salary              3.3
Name: 2006, dtype: object

In [8]:
jamesbond.loc[1967]

                     Film         Actor  Box Office  Budget  Bond Actor Salary
Year
1967        Casino Royale   David Niven       315.0    85.0                NaN
1967  You Only Live Twice  Sean Connery       514.2    59.9                4.4

In [9]:
jamesbond = jamesbond.set_index("Actor")
jamesbond = jamesbond.sort_index(ascending=False)
jamesbond.head(5)

                                 Film  Box Office  Budget  Bond Actor Salary
Actor
Timothy Dalton        Licence to Kill       250.9    56.7                7.9
Timothy Dalton   The Living Daylights       313.5    68.8                5.2
Sean Connery                   Dr. No       448.8     7.0                0.6
Sean Connery     Diamonds Are Forever       442.5    34.7                5.8
Sean Connery    From Russia with Love       543.8    12.6                1.6

In [10]:
jamesbond.loc['Sean Connery']

                               Film  Box Office  Budget  Bond Actor Salary
Actor
Sean Connery                 Dr. No       448.8     7.0                0.6
Sean Connery   Diamonds Are Forever       442.5    34.7                5.8
Sean Connery  From Russia with Love       543.8    12.6                1.6
Sean Connery  Never Say Never Again       380.0    86.0                NaN
Sean Connery            Thunderball       848.1    41.9                4.7
Sean Connery    You Only Live Twice       514.2    59.9                4.4
Sean Connery             Goldfinger       820.4    18.6                3.2

In [11]:
jamesbond = jamesbond.set_index("Film")
jamesbond.tail(10)

                                 Box Office  Budget  Bond Actor Salary
Film
The World Is Not Enough               439.5   158.3               13.5
Die Another Day                       465.4   154.2               17.9
GoldenEye                             518.5    76.9                5.1
Tomorrow Never Dies                   463.2   133.9               10.0
On Her Majesty's Secret Service       291.5    37.3                0.6
Casino Royale                         315.0    85.0                NaN
Casino Royale                         581.5   145.3                3.3
Quantum of Solace                     514.2   181.4                8.1
Skyfall                               943.5   170.2               14.5
Spectre                               726.7   206.3                NaN

In [12]:
jamesbond.loc["Tomorrow Never Dies":"Skyfall"]

                                 Box Office  Budget  Bond Actor Salary
Film
Tomorrow Never Dies                   463.2   133.9               10.0
On Her Majesty's Secret Service       291.5    37.3                0.6
Casino Royale                         315.0    85.0                NaN
Casino Royale                         581.5   145.3                3.3
Quantum of Solace                     514.2   181.4                8.1
Skyfall                               943.5   170.2               14.5

In [13]:
jamesbond.loc[["Spectre", "Quantum of Solace","The World Is Not Enough"]]

                         Box Office  Budget  Bond Actor Salary
Film
Spectre                       726.7   206.3                NaN
Quantum of Solace             514.2   181.4                8.1
The World Is Not Enough       439.5   158.3               13.5

In [14]:
"Die Another Day" in jamesbond.index

True

In [15]:
jamesbond = jamesbond.reset_index(drop=False)
jamesbond.head(10)

                    Film  Box Office  Budget  Bond Actor Salary
0        Licence to Kill       250.9    56.7                7.9
1   The Living Daylights       313.5    68.8                5.2
2                 Dr. No       448.8     7.0                0.6
3   Diamonds Are Forever       442.5    34.7                5.8
4  From Russia with Love       543.8    12.6                1.6
5  Never Say Never Again       380.0    86.0                NaN
6            Thunderball       848.1    41.9                4.7
7    You Only Live Twice       514.2    59.9                4.4
8             Goldfinger       820.4    18.6                3.2
9       Live and Let Die       460.3    30.8                NaN

In [16]:
jamesbond.loc[15]

Film                 A View to a Kill
Box Office                      275.2
Budget                           54.5
Bond Actor Salary                 9.1
Name: 15, dtype: object

In [17]:
jamesbond.iloc[15]         # iloc[] is used for integer index based on retrieving of rows

Film                 A View to a Kill
Box Office                      275.2
Budget                           54.5
Bond Actor Salary                 9.1
Name: 15, dtype: object

In [18]:
print(jamesbond.iloc[3:7])
print(jamesbond.iloc[[25,3]])

                    Film  Box Office  Budget  Bond Actor Salary
3   Diamonds Are Forever       442.5    34.7                5.8
4  From Russia with Love       543.8    12.6                1.6
5  Never Say Never Again       380.0    86.0                NaN
6            Thunderball       848.1    41.9                4.7
                    Film  Box Office  Budget  Bond Actor Salary
25               Spectre       726.7   206.3                NaN
3   Diamonds Are Forever       442.5    34.7                5.8

In [19]:
jamesbond = jamesbond.set_index("Film")
jamesbond.head(5)

                       Box Office  Budget  Bond Actor Salary
Film
Licence to Kill             250.9    56.7                7.9
The Living Daylights        313.5    68.8                5.2
Dr. No                      448.8     7.0                0.6
Diamonds Are Forever        442.5    34.7                5.8
From Russia with Love       543.8    12.6                1.6

In [20]:
jamesbond.iloc[[2,4,6,8,10]]

                             Box Office  Budget  Bond Actor Salary
Film
Dr. No                            448.8     7.0                0.6
From Russia with Love             543.8    12.6                1.6
Thunderball                       848.1    41.9                4.7
Goldfinger                        820.4    18.6                3.2
The Man with the Golden Gun       334.0    27.7                NaN

In [21]:
jamesbond.ix["GoldenEye"]

AttributeError: ignored